######################################
###이상치 정제할시 이상치를 제거하면## 
###그 데이터의 행 자체가 제거되는데###
#######그래도 괜찮은 것인가?##########
######################################
# 방법(1) 이상치 값을 제거 : 같은 행의 다른컬럼 값도 제거됨
mpg2 <- subset(mpg,hwy>=12&hwy<=37)
mpg2 <- filter(mpg,hwy>=12&hwy<=37)
length(mpg2$hwy) # 231 : 3개 정제됨
boxplot(mpg2$hwy)
# 방법(2) 이상치 값을 결측치로 대체
hwy2 <- ifelse(mpg$hwy<12|mpg$hwy>37,NA,mpg$hwy)
mpg$hwy2 <- hwy2
mpg_df <- as.data.frame((mpg))
mpg_df[c('hwy','hwy2')]





#########################################
##매트릭스나 데이터프레임 백터로 바꾸기##
#########################################
res <- dataset$resident #vector :  int [1:300]
res4 <- dataset[,1] %>% head() #vector :num [1:6]





#######################################
#########pie값 이상하게 나옴###########
#######################################
head(dataset3,20)
dataset3$gender2[dataset3$gender==1]<-'남자'
dataset3$gender2[dataset3$gender==2]<-'여자'
pie(dataset3$gender2) #error
pie(table(dataset3$gender2)) #success






#######################################
######데이터에 칼럼 삭제 하는법########
#######################################
user_pay_data <- user_pay_data[-13]







########################################
####교차테이블에 NA값 유무 확인하기#####
########################################
table(new_data$job2,new_data$age2,useNA='ifany') 





###################################################################
###########여러개의 컬럼을 가지고 있는 데이터 중에#################
###한개 컬럼에서 조건에 부합하지 않는 데이터의 모든 행을 제거해서##
#############새로운 데이터를 형성하는 방법 subset##################
###################################################################
#subset()
#filter()




